In [1]:
import pandas as pd
import numpy as np

from pandas import Series, DataFrame

In [3]:
filename = '../data/taxi.csv'
df = pd.read_csv(filename)

In [4]:
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30

In [8]:
# mean trip_distance where passenger_count is 1

df.loc[ 
    df['passenger_count']==1 # row selector
    , 
    'trip_distance'
].mean()

3.0923380047176354

In [9]:
df.groupby('passenger_count')['trip_distance'].mean()

passenger_count
0    4.600000
1    3.092338
2    3.384387
3    3.342389
4    3.628901
5    3.182712
6    3.170976
Name: trip_distance, dtype: float64

In [11]:
df.groupby('passenger_count',sort=False)['trip_distance'].mean()

passenger_count
1    3.092338
4    3.628901
3    3.342389
2    3.384387
5    3.182712
6    3.170976
0    4.600000
Name: trip_distance, dtype: float64

In [12]:
df.groupby(

SyntaxError: incomplete input (368738010.py, line 1)

In [14]:
filename = '../data/olympic_athlete_events.csv'

df = pd.read_csv(filename)
df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [21]:
AVG_age = df.groupby('Sport')['Age'].mean().sort_values()
AVG_age.head(-1)

Sport
Rhythmic Gymnastics      18.737082
Swimming                 20.566803
Figure Skating           22.232190
Synchronized Swimming    22.366851
Diving                   22.481441
                           ...
Croquet                  33.733333
Equestrianism            34.390831
Polo                     35.333333
Alpinism                 38.812500
Art Competitions         45.901009
Name: Age, Length: 65, dtype: float64

In [23]:
df.loc[
    df['Year']>1960
].groupby('Sport')['Height'].max()

Sport
Alpine Skiing                200.0
Archery                      197.0
Athletics                    208.0
Badminton                    201.0
Baseball                     206.0
Basketball                   226.0
Beach Volleyball             212.0
Biathlon                     200.0
Bobsleigh                    205.0
Boxing                       205.0
Canoeing                     205.0
Cross Country Skiing         200.0
Curling                      197.0
Cycling                      201.0
Diving                       188.0
Equestrianism                197.0
Fencing                      208.0
Figure Skating               193.0
Football                     200.0
Freestyle Skiing             197.0
Golf                         196.0
Gymnastics                   185.0
Handball                     214.0
Hockey                       200.0
Ice Hockey                   206.0
Judo                         213.0
Luge                         199.0
Modern Pentathlon            198.0
Nordic Combined              193.0
Rhythmic Gymnastics          181.0
Rowing                       209.0
Rugby Sevens                 198.0
Sailing                      213.0
Shooting                     213.0
Short Track Speed Skating    191.0
Skeleton                     197.0
Ski Jumping                  200.0
Snowboarding                 194.0
Softball                     198.0
Speed Skating                203.0
Swimming                     209.0
Synchronized Swimming        185.0
Table Tennis                 198.0
Taekwondo                    207.0
Tennis                       208.0
Trampolining                 185.0
Triathlon                    196.0
Volleyball                   219.0
Water Polo                   206.0
Weightlifting                205.0
Wrestling                    214.0
Name: Height, dtype: float64

In [26]:
filename = '../data/taxi.csv'
df = pd.read_csv(filename)

In [27]:
df.groupby(['passenger_count','VendorID'])['trip_distance'].mean()

passenger_count  VendorID
0                1           4.600000
1                1           2.956456
                 2           3.262967
2                1           3.452027
                 2           3.328849
3                1           3.588535
                 2           3.187189
4                1           3.952239
                 2           3.440522
5                1           4.933333
                 2           3.172553
6                2           3.170976
Name: trip_distance, dtype: float64

In [28]:
df.groupby(['passenger_count','VendorID'])['trip_distance'].mean().loc[4]

VendorID
1    3.952239
2    3.440522
Name: trip_distance, dtype: float64

In [29]:
df.groupby(['passenger_count','VendorID'])['trip_distance'].mean().loc[[4,6]]

passenger_count  VendorID
4                1           3.952239
                 2           3.440522
6                2           3.170976
Name: trip_distance, dtype: float64

In [32]:
df.groupby(['passenger_count'])[['trip_distance','total_amount']].mean()

                 trip_distance  total_amount
passenger_count
0                     4.600000     25.570000
1                     3.092338     17.368569
2                     3.384387     18.406306
3                     3.342389     17.994704
4                     3.628901     18.881648
5                     3.182712     17.211269
6                     3.170976     17.401355

In [34]:
df.groupby(['passenger_count'])[['trip_distance','total_amount']].agg(['mean','min','max'])

                trip_distance             total_amount
                         mean  min    max         mean    min     max
passenger_count
0                    4.600000  1.3   7.90    25.570000  14.75   36.39
1                    3.092338  0.0  64.60    17.368569  -7.80  252.35
2                    3.384387  0.0  29.78    18.406306   0.30  138.84
3                    3.342389  0.0  21.80    17.994704   4.80   74.46
4                    3.628901  0.0  22.67    18.881648   3.30   73.84
5                    3.182712  0.0  24.97    17.211269   3.30  102.11
6                    3.170976  0.0  23.81    17.401355   3.30   83.12

In [37]:
filename = '../data/olympic_athlete_events.csv'

df = pd.read_csv(filename)
df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [48]:
df.groupby(['Year','Team'])['Height'].max()

Year  Team
1896  Australia                          NaN
      Australia/Great Britain            NaN
      Austria                            NaN
      Denmark                            NaN
      Ethnikos Gymnastikos Syllogos      NaN
                                       ...
2016  Venezuela                        206.0
      Vietnam                          185.0
      Yemen                            174.0
      Zambia                           182.0
      Zimbabwe                         191.0
Name: Height, Length: 5170, dtype: float64

In [42]:
df.groupby(['Year'])['Age'].agg(['min','max'])

       min   max
Year
1896  10.0  40.0
1900  13.0  71.0
1904  14.0  71.0
1906  13.0  54.0
1908  14.0  61.0
1912  13.0  67.0
1920  13.0  72.0
1924  11.0  81.0
1928  11.0  97.0
1932  11.0  96.0
1936  11.0  74.0
1948  12.0  84.0
1952  12.0  65.0
1956  12.0  67.0
1960  11.0  65.0
1964  12.0  60.0
1968  11.0  68.0
1972  12.0  69.0
1976  12.0  70.0
1980  13.0  70.0
1984  12.0  60.0
1988  11.0  70.0
1992  11.0  62.0
1994  13.0  46.0
1996  12.0  63.0
1998  14.0  50.0
2000  13.0  63.0
2002  15.0  48.0
2004  13.0  57.0
2006  14.0  52.0
2008  12.0  67.0
2010  15.0  51.0
2012  13.0  71.0
2014  15.0  55.0
2016  13.0  62.0

In [43]:
df.groupby(['Sport'])['Weight'].agg(['median','mean'])

                  median       mean
Sport
Aeronautics          NaN        NaN
Alpine Skiing       71.0  72.068110
Alpinism             NaN        NaN
Archery             69.0  70.011135
Art Competitions    76.0  75.290909
...                  ...        ...
Tug-Of-War          95.0  95.615385
Volleyball          78.0  78.900214
Water Polo          84.0  84.566446
Weightlifting       75.0  78.726663
Wrestling           72.0  75.495570

[66 rows x 2 columns]

In [45]:
df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [49]:
results = (
    df
    .groupby(['Year','Team'])[['Age','Height']].agg(['min','max'])
)
results

                                     Age       Height
                                     min   max    min    max
Year Team
1896 Australia                      22.0  22.0    NaN    NaN
     Australia/Great Britain        22.0  23.0    NaN    NaN
     Austria                        19.0  23.0    NaN    NaN
     Denmark                        21.0  34.0    NaN    NaN
     Ethnikos Gymnastikos Syllogos  10.0  10.0    NaN    NaN
...                                  ...   ...    ...    ...
2016 Venezuela                      19.0  52.0  153.0  206.0
     Vietnam                        19.0  42.0  155.0  185.0
     Yemen                          16.0  24.0  166.0  174.0
     Zambia                         20.0  28.0  170.0  182.0
     Zimbabwe                       21.0  42.0  155.0  191.0

[5170 rows x 4 columns]

In [50]:
results.loc['1900:1920']

KeyError: '1900:1920'